### Part 9. Casting Datatypes and Handling Missing Values

In [20]:
import pandas as pd
import numpy as np

In [21]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'],
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'],
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JaneDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [22]:
df = pd.DataFrame(people)

In [33]:
df.replace(['NA', 'Missing'], np.nan, inplace=True)

In [34]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JaneDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [25]:
df.dropna()

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JaneDoe@email.com  63

In [26]:
df.dropna(axis='index', how='any')
# default values
# axis index or columns - what is going to be dropped
# how any(if any value is na), all(if all values is na)

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JaneDoe@email.com  63

In [27]:
df.dropna(axis='index', how='any', subset=['email'])

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JaneDoe@email.com    63
5   None      NaN      Anonymous@email.com  None

In [28]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True  False   True  False

In [29]:
# df.fillna('MISSING')

In [30]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [35]:
df['age'] = df['age'].astype(float)

In [36]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [37]:
df['age'].mean()

46.75